Documents/ПеняПоВзносамИОтчислениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПеняПоВзносамИОтчислениям</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами</xr:Item>
				<xr:Item>AccumulationRegister.ПениПоВзносамИОтчислениям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНалогаВзносаОтчисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределениеПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПеречисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВГосБюджет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсчислениеПени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНалоговогоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрацияВНалоговомОргане</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланируемаяДатаПеречисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейПросрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗадолженности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>НалогиВзносыОтчисленияРасчетыСБюджетомИФондами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НалогВзнос</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалогаВзносаОтчисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВГосБюджет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/НастройкиЗарплатаКадрыРасширенная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиЗарплатаКадрыРасширенная</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВыплатыАвансаНеПозжеЧем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыплатыЗарплатыНеПозжеЧем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентДоплатыЗаДниНетрудоспособности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьТерриториальныеУсловияПФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыплачиватьЗарплатуВПоследнийДеньМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОбособленныеТерритории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОсобыеУсловияТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользуютсяТерриторииЗаПределамиРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВестиУчетРабочегоВремениПоУсловиямТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СрокиПеречисленияВзносовИОтчислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СрокиПеречисленияВзносовИОтчислений</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПеречисленияНеПозжеЧем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОпределенияСрокаПеречисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокОпределенияСроковПеречисленияВзносовИОтчислений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалогаВзносаОтчисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтавкаРефинансированияЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтавкаРефинансированияЦБ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КоэффициентыСтавкиРефинансированияНБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КоэффициентыСтавкиРефинансированияНБ</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалогаВзносаОтчисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗанятости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыЗанятости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПеняПоВзносамИОтчислениям/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки.
	СуммаПоДокументу = ИсчислениеПени.Итог("Сумма");

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ДанныеДляПроведения = ДанныеДляПроведения();

	// Налоги, взносы и отчисления - расчеты с бюджетом и фондами
	УчетНалоговВзносовОтчислений.СформироватьНалогиВзносыОтчисленияРасчетыСБюджетом(ДанныеДляПроведения, Движения, Отказ, Организация, НачалоМесяца(ПериодРегистрации), ВидПлатежа, Ложь,,Истина);

	// Пени по взносам и отчислениям
	УчетНалоговВзносовОтчислений.СформироватьПениПоВзносамИОтчислениям(Движения, Отказ, Организация,НачалоМесяца(ПериодРегистрации), ДанныеДляПроведения.РезультатыРасчетаПени);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МожноЗаполнитьИсчислениеПени() Экспорт
	
	ПравилаПроверки = Новый Структура;
	
	ПравилаПроверки.Вставить("Организация",					НСтр("ru='Не выбрана организация'"));
	ПравилаПроверки.Вставить("ПериодРегистрации",			НСтр("ru='Не задан период начисления пени'"));
	ПравилаПроверки.Вставить("Дата",						НСтр("ru='Не задана дата документа'"));
	ПравилаПроверки.Вставить("ВидНалогаВзносаОтчисления",	НСтр("ru='Не указан вид взноса, отчисления'"));
	ПравилаПроверки.Вставить("ВидПлатежа",					НСтр("ru='Не указан вид платежа'"));
	ПравилаПроверки.Вставить("ДатаНачала",					НСтр("ru='Не указано начало периода заполнения'"));
	ПравилаПроверки.Вставить("ДатаОкончания",				НСтр("ru='Не указано окончание периода заполнения'"));
	ПравилаПроверки.Вставить("ДатаПеречисления",			НСтр("ru='Не указана дата перечисления задолженности'"));
	Если РаспределениеПени Тогда
		ПравилаПроверки.Вставить("СуммаПоДокументу",		НСтр("ru='Не указана сумма к распределению'"));
	КонецЕсли;

	Возврат	ЗарплатаКадры.СвойстваЗаполнены(ЭтотОбъект, ПравилаПроверки);

КонецФункции

Процедура СоздатьВТСотрудникиДляВедомостиПоФизическимЛицам(МенеджерВременныхТаблиц, ФизическиеЛица);

	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	
	ПараметрыПолученияСотрудников.СписокФизическихЛиц = ФизическиеЛица;
	
	ЗаполнитьПараметрыПолученияСотрудниковПоШапкеВедомости(ПараметрыПолученияСотрудников);	
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		МенеджерВременныхТаблиц, Истина, 
		ПараметрыПолученияСотрудников, 
		"ВТСотрудникиДляВедомости");  
		
КонецПроцедуры

Функция ДополнитьИсчислениеПени(ФизическиеЛица) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СоздатьВТСотрудникиДляВедомостиПоФизическимЛицам(МенеджерВременныхТаблиц, ФизическиеЛица);
	
	// Получаем кадровые данные сотрудников с полями для сортировки. 	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(МенеджерВременныхТаблиц, "ВТСотрудникиДляВедомости");
	КадровыеДанные = "";
	ЗарплатаКадры.ДополнитьКадровымиДаннымиНастройкиПорядкаСписка(КадровыеДанные);
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
	
	ЗадолженностьПоВзносамИОтчислениям = ЗадолженностьПоВзносамИОтчислениям(МенеджерВременныхТаблиц);
	
	Если РаспределениеПени Тогда
		ТаблицаРасчетаПени = ИсчислениеПени.Выгрузить(, "РегистрацияВНалоговомОргане, ФизическоеЛицо, МесяцНалоговогоПериода, СуммаЗадолженности");
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ЗадолженностьПоВзносамИОтчислениям, ТаблицаРасчетаПени);
		ПеняПоВзносамИОтчислениям = РаспределитьПеню(ТаблицаРасчетаПени);
		РезультатыРасчетов = ЗаполнитьПодразделения(ПеняПоВзносамИОтчислениям);
		ИсчислениеПени.Загрузить(РезультатыРасчетов);
	Иначе
		
		ПеняПоВзносамИОтчислениям = ПеняПоВзносамИОтчислениям(ЗадолженностьПоВзносамИОтчислениям);
		РезультатыРасчетов = ЗаполнитьПодразделения(ПеняПоВзносамИОтчислениям);
		
		Для Каждого СтрокаПени ИЗ РезультатыРасчетов Цикл
			ЗаполнитьЗначенияСвойств(ИсчислениеПени.Добавить(), СтрокаПени);
		КонецЦикла;
		СуммаПоДокументу = ИсчислениеПени.Итог("Сумма");
	КонецЕсли;
	
	Для Каждого Элемент Из ФизическиеЛица Цикл
		
		НайденнаяСтрока = ЗадолженностьПоВзносамИОтчислениям.Найти(Элемент,"ФизическоеЛицо");
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для сотрудника: %1 отсутствует задолженность по виду взноса, отчисления: %2 на %3'"),
				Элемент,ВидНалогаВзносаОтчисления,Формат(ДатаПеречисления,"ДЛФ=DD"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Процедура ЗаполнитьИсчислениеПени() Экспорт
	
	ИсчислениеПени.Очистить();
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТСотрудникиДляВедомостиПоШапке(МенеджерВременныхТаблиц);
	
	// Получаем кадровые данные сотрудников с полями для сортировки. 	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(МенеджерВременныхТаблиц, "ВТСотрудникиДляВедомости");
	КадровыеДанные = "";
	ЗарплатаКадры.ДополнитьКадровымиДаннымиНастройкиПорядкаСписка(КадровыеДанные);
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
	
	ЗадолженностьПоВзносамИОтчислениям = ЗадолженностьПоВзносамИОтчислениям(МенеджерВременныхТаблиц);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ЗадолженностьПоВзносамИОтчислениямГПХ(МенеджерВременныхТаблиц),ЗадолженностьПоВзносамИОтчислениям);
	
	Если РаспределениеПени Тогда
		ПеняПоВзносамИОтчислениям = РаспределитьПеню(ЗадолженностьПоВзносамИОтчислениям);
	Иначе
		ПеняПоВзносамИОтчислениям = ПеняПоВзносамИОтчислениям(ЗадолженностьПоВзносамИОтчислениям);
	КонецЕсли;
	
	РезультатыРасчетов = ЗаполнитьПодразделения(ПеняПоВзносамИОтчислениям);
		
	ИсчислениеПени.Загрузить(РезультатыРасчетов);
	
	СуммаПоДокументу = ИсчислениеПени.Итог("Сумма");
	
КонецПроцедуры

Процедура ПересчитатьРаспределениеПени() Экспорт
	
	ПеняПоВзносамИОтчислениям = ИсчислениеПени.Выгрузить();
	ПеняПоВзносамИОтчислениям.Колонки.Удалить("Сумма");
	ИсчислениеПени.Загрузить(РаспределитьПеню(ПеняПоВзносамИОтчислениям));
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыПолученияСотрудниковПоШапкеВедомости(ПараметрыПолученияСотрудников)

	// Получаем всех работавших в организации в месяце периода задержанной зарплаты.
	ПараметрыПолученияСотрудников.Организация 					= Организация;
	ПараметрыПолученияСотрудников.ОтбиратьПоГоловнойОрганизации 	= Ложь;
	// отбор по подразделению осуществляем в запросе, тк необходим анализ совместительства в разных организациях/подразделениях
	ПараметрыПолученияСотрудников.НачалоПериода 					= НачалоМесяца(ДатаНачала);
	ПараметрыПолученияСотрудников.ОкончаниеПериода				= КонецМесяца(ДатаОкончания);
	ПараметрыПолученияСотрудников.РаботникиПоТрудовымДоговорам 	= Истина;
	ПараметрыПолученияСотрудников.РаботникиПоДоговорамГПХ 		= Истина;
	
	ПараметрыПолученияСотрудников.КадровыеДанные = "Подразделение,ВидЗанятости,ВидСобытия,ДатаУвольнения,Организация";	

	КадровыйУчетРасширенный.ПрименитьОтборПоФункциональнойОпцииВыполнятьРасчетЗарплатыПоПодразделениям(ПараметрыПолученияСотрудников);
	
КонецПроцедуры

Процедура СоздатьВТСотрудникиДляВедомостиПоШапке(МенеджерВременныхТаблиц)
	
	// Отбор сотрудников по организации и подразделению.
	СоздатьВТСотрудникиДляВедомостиПоМестуРаботы(МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаДляКадровыхДанных", Дата);
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	&ДатаДляКадровыхДанных КАК Период
	|ПОМЕСТИТЬ ВТСотрудникиДляВедомости
	|ИЗ
	|	ВТСотрудникиПоМестуРаботы КАК Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСотрудникиПоМестуРаботы";
	
	Запрос.Выполнить();
	
КонецПроцедуры	

Процедура СоздатьВТСотрудникиДляВедомостиПоМестуРаботы(МенеджерВременныхТаблиц)
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	
	ЗаполнитьПараметрыПолученияСотрудниковПоШапкеВедомости(ПараметрыПолученияСотрудников);

	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		МенеджерВременныхТаблиц, Истина, 
		ПараметрыПолученияСотрудников, 
		"ВТСотрудникиПоМестуРаботыПоШапкеВедомости");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// при отборе по подразделениям	берем относящихся к нему на конец периода
	Если ПолучитьФункциональнуюОпцию("ВыполнятьРасчетЗарплатыПоПодразделениям") 
			 И ЗначениеЗаполнено(ЭтотОбъект.Подразделение) Тогда
		ОтборПоПодразделению = Истина;
		Запрос.УстановитьПараметр("Подразделение", ЭтотОбъект.Подразделение);
		Запрос.УстановитьПараметр("ОтборПоПодразделению", Истина);
	Иначе
		Запрос.УстановитьПараметр("Подразделение", ЭтотОбъект.Подразделение);
		Запрос.УстановитьПараметр("ОтборПоПодразделению", Ложь);
	КонецЕсли;
	
	Запрос.Текст = 
		 "ВЫБРАТЬ РАЗЛИЧНЫЕ 
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.Организация КАК Организация,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудникиОсновныеМестаРаботы
		|ИЗ
		|	ВТСотрудникиПоМестуРаботыПоШапкеВедомости КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.Подразделение КАК Подразделение,
		|	Сотрудники.ВидЗанятости КАК ВидЗанятости,
		|	ВЫБОР
		|		КОГДА Сотрудники.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|			ТОГДА 3
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Сотрудники.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство))
		|					ТОГДА 2
		|				ИНАЧЕ 1
		|			КОНЕЦ
		|	КОНЕЦ КАК ПриоритетСостояния,
		|	ВЫБОР
		|		КОГДА Сотрудники.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|			ТОГДА Сотрудники.ДатаУвольнения
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаУвольнения
		|ПОМЕСТИТЬ ВТСотрудникиПоПриоритетам
		|ИЗ
		|	ВТСотрудникиПоМестуРаботыПоШапкеВедомости КАК Сотрудники
		// исключим внутренних совместителей в рамках одной организации
		// записи с внутренними совместителями филиала остануться
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиОсновныеМестаРаботы КАК СотрудникиОсновныеМестаРаботы
		|		ПО Сотрудники.ФизическоеЛицо = СотрудникиОсновныеМестаРаботы.ФизическоеЛицо
		|			И Сотрудники.Организация = СотрудникиОсновныеМестаРаботы.Организация
		|ГДЕ
		|	(НЕ &ОтборПоПодразделению
		|				И Сотрудники.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство))
		|			ИЛИ &ОтборПоПодразделению
		|				И Сотрудники.Подразделение В ИЕРАРХИИ (&Подразделение)
		|				И (Сотрудники.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство))
		|					ИЛИ Сотрудники.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ВнутреннееСовместительство)
		|						И СотрудникиОсновныеМестаРаботы.Сотрудник ЕСТЬ NULL))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСотрудникиПоПриоритетам.ФизическоеЛицо,
		|	МИНИМУМ(ВТСотрудникиПоПриоритетам.ПриоритетСостояния) КАК ПриоритетСостояния,
		|	МАКСИМУМ(ВТСотрудникиПоПриоритетам.ДатаУвольнения) КАК ДатаУвольнения
		|ПОМЕСТИТЬ ВТПриоритеты
		|ИЗ
		|	ВТСотрудникиПоПриоритетам КАК ВТСотрудникиПоПриоритетам
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСотрудникиПоПриоритетам.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСотрудникиПоПриоритетам.Сотрудник,
		|	ВТСотрудникиПоПриоритетам.ФизическоеЛицо,
		|	ВТСотрудникиПоПриоритетам.Подразделение
		|ПОМЕСТИТЬ ВТСотрудникиАктуальные
		|ИЗ
		|	ВТСотрудникиПоПриоритетам КАК ВТСотрудникиПоПриоритетам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПриоритеты КАК ВТПриоритеты
		|		ПО ВТСотрудникиПоПриоритетам.ФизическоеЛицо = ВТПриоритеты.ФизическоеЛицо
		|			И ВТСотрудникиПоПриоритетам.ПриоритетСостояния = ВТПриоритеты.ПриоритетСостояния
		|			И (ВЫБОР
		|				КОГДА ВТСотрудникиПоПриоритетам.ПриоритетСостояния = 3
		|					ТОГДА ВТСотрудникиПоПриоритетам.ДатаУвольнения = ВТПриоритеты.ДатаУвольнения
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)";
		
	Запрос.Выполнить();	
		
	ИмяВТСотрудникиПоМестуРаботы = "ВТСотрудникиАктуальные";
	
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТСотрудникиАктуальные";
	// при отборе по подразделениям	берем относящихся к нему на конец периода
	Если ЗначениеЗаполнено(ПараметрыПолученияСотрудников.Подразделение) Тогда
		
		Запрос.УстановитьПараметр("Подразделение", ПараметрыПолученияСотрудников.Подразделение);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТСотрудникиОтносящиесяКПодразделению
		|ИЗ
		|	#ВТСотрудникиПоМестуРаботы КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Подразделение В ИЕРАРХИИ(&Подразделение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ #ВТСотрудникиПоМестуРаботы";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудникиПоМестуРаботы", ИмяВТСотрудникиПоМестуРаботы);
		
		Запрос.Выполнить();

		ИмяВТСотрудникиПоМестуРаботы = "ВТСотрудникиОтносящиесяКПодразделению";
		
	КонецЕсли;	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.Подразделение
	|ПОМЕСТИТЬ ВТСотрудникиПоМестуРаботы
	|ИЗ
	|	#ВТСотрудникиПоМестуРаботы КАК Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ #ВТСотрудникиПоМестуРаботы";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудникиПоМестуРаботы", ИмяВТСотрудникиПоМестуРаботы);
	
	Запрос.Выполнить();
	
КонецПроцедуры	

Функция ЗадолженностьПоВзносамИОтчислениям(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	// при наличии возврата в день перечисления + повторного перечисления на следующий день остатки необходимо получать предыдущим днем
	Запрос.УстановитьПараметр("ДатаАктуальности", НачалоДня(ДатаПеречисления) - 1);
	Запрос.УстановитьПараметр("ВидВзносаОтчисления", ВидНалогаВзносаОтчисления);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыСБюджетомИФондамиОстатки.РегистрацияВНалоговомОргане,
		|	РасчетыСБюджетомИФондамиОстатки.ФизическоеЛицо,
		|	РасчетыСБюджетомИФондамиОстатки.МесяцНалоговогоПериода,
		|	РасчетыСБюджетомИФондамиОстатки.НалогВзносОстаток КАК СуммаЗадолженности
		|ИЗ
		|	РегистрНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Остатки(
		|			&ДатаАктуальности,
		|			Организация = &Организация
		|				И ФизическоеЛицо В (ВЫБРАТЬ СотрудникиДляВедомости.ФизическоеЛицо ИЗ ВТСотрудникиДляВедомости КАК СотрудникиДляВедомости)
		|				И ВидНалогаВзносаОтчисления = &ВидВзносаОтчисления
		|				И ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
		|				И (МесяцНалоговогоПериода МЕЖДУ &ДатаНачала И &ДатаОкончания)) КАК РасчетыСБюджетомИФондамиОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК Сотрудники
		|		ПО (РасчетыСБюджетомИФондамиОстатки.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)";
	
	ЗарплатаКадры.ДополнитьТекстЗапросаУпорядочиваниемСотрудниковПоВТСДаннымиПорядка(Запрос, "Сотрудники");	
		
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

Функция ЗадолженностьПоВзносамИОтчислениямГПХ(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаАктуальности", НачалоДня(ДатаПеречисления) - 1);
	Запрос.УстановитьПараметр("ВидВзносаОтчисления", ВидНалогаВзносаОтчисления);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	ОтборПоПодразделению = Ложь;
	
	Если ПолучитьФункциональнуюОпцию("ВыполнятьРасчетЗарплатыПоПодразделениям") 
			 И ЗначениеЗаполнено(Подразделение) Тогда
		ОтборПоПодразделению = Истина;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОтборПоПодразделению", ОтборПоПодразделению);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыСБюджетомИФондамиОстатки.РегистрацияВНалоговомОргане,
		|	РасчетыСБюджетомИФондамиОстатки.ФизическоеЛицо,
		|	РасчетыСБюджетомИФондамиОстатки.МесяцНалоговогоПериода,
		|	РасчетыСБюджетомИФондамиОстатки.НалогВзносОстаток КАК СуммаЗадолженности
		|ИЗ
		|	РегистрНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Остатки(
		|			&ДатаАктуальности,
		|			Организация = &Организация
		|				И ФизическоеЛицо НЕ В (ВЫБРАТЬ СотрудникиДляВедомости.ФизическоеЛицо ИЗ ВТСотрудникиДляВедомости КАК СотрудникиДляВедомости)
		|				И ВидНалогаВзносаОтчисления = &ВидВзносаОтчисления
		|				И ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
		|				И (МесяцНалоговогоПериода МЕЖДУ &ДатаНачала И &ДатаОкончания)) КАК РасчетыСБюджетомИФондамиОстатки
		|ГДЕ
		|	&ОтборПоПодразделению = ЛОЖЬ";
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция РаспределитьПеню(РасчетПени)
	
	РасчетПени.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	КоэффициентыРаспределения = ОбщегоНазначения.ВыгрузитьКолонку(РасчетПени, "СуммаЗадолженности");
	РаспределениеСуммыПени = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаПоДокументу, КоэффициентыРаспределения, 2);
	
	Если РаспределениеСуммыПени <> Неопределено Тогда
		Индекс = 0;
		Для Каждого СтрокаПени Из РасчетПени Цикл
			СтрокаПени.Сумма = РаспределениеСуммыПени[Индекс];
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЕсли;
	
	ДополнитьСведениямиОПросрочке(РасчетПени);
	
	Возврат РасчетПени;
	
КонецФункции

Функция ПеняПоВзносамИОтчислениям(РасчетПени)
	
	ДополнитьСведениямиОПросрочке(РасчетПени);
	РасчетПени.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	
	ПервыйДеньЗадержки = ДатаПеречисления;
	Для Каждого СтрокаПени Из РасчетПени Цикл
		ПервыйДеньЗадержки = Мин(ПервыйДеньЗадержки, СтрокаПени.ПланируемаяДатаПеречисления); 
	КонецЦикла;	
	
	СтавкиИКоэффициентыПоПериоду = СтавкиИКоэффициентыПоПериоду(ПервыйДеньЗадержки);

	МассивПустыхСтрок = Новый Массив;

	Для Каждого СтрокаПени Из РасчетПени Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаПени.ПланируемаяДатаПеречисления) Тогда
			МассивПустыхСтрок.Добавить(СтрокаПени);
			Продолжить;
		КонецЕсли;
		
		// первый день просрочки
		ДеньПросрочки = СтрокаПени.ПланируемаяДатаПеречисления + 86400;
		СуммаПени = 0;
		
		// Пеня в соответствии с подпунктом 2) пункта 2 статьи 117 Налогового кодекса начисляется за каждый день просрочки исполнения налогового обязательства, 
		// начиная со дня, следующего за днем срока уплаты налога и платежа в бюджет, включая день уплаты
		// далее расчет пени по дням периода, в связи с чем дни просрочки в формуле не используем
		Пока ДеньПросрочки <= ДатаПеречисления Цикл
			
			СтрокаДанных = СтавкиИКоэффициентыПоПериоду.Найти(ДеньПросрочки, "ДатаПериода");
			Если НЕ СтрокаДанных = Неопределено Тогда
				СуммаПени = СуммаПени + ((СтрокаПени.СуммаЗадолженности * СтрокаДанных.КоэффициентСтавкиРефинансирования * СтрокаДанных.СтавкаРефинансирования) / 365);	
			КонецЕсли;
			
			ДеньПросрочки = ДеньПросрочки + 86400;
			
		КонецЦикла;
		
		СтрокаПени.Сумма = СуммаПени;
		
	КонецЦикла;
	
	Для Каждого СтрокаМассива Из МассивПустыхСтрок Цикл
		РасчетПени.Удалить(СтрокаМассива);
	КонецЦикла;
	
	Возврат РасчетПени;
	
КонецФункции

Процедура ДополнитьСведениямиОПросрочке(РасчетПени)
	
	Если РасчетПени.Колонки.Найти("ПланируемаяДатаПеречисления") = Неопределено Тогда
		РасчетПени.Колонки.Добавить("ПланируемаяДатаПеречисления", Новый ОписаниеТипов("Дата"));
		РасчетПени.Колонки.Добавить("КоличествоДнейПросрочки", Новый ОписаниеТипов("Число"));
	КонецЕсли;
		
	Если РасчетПени.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДлинаСуток = 86400;

	Настройки = СведенияОНастройкахПеречисленияВзносовИОтчислений(РасчетПени.Скопировать(,"МесяцНалоговогоПериода"));

	Для Каждого СтрокаПени Из РасчетПени Цикл
		
		ПланируемаяДатаПеречисления = ПолучитьПланируемуюДатуПеречисления(СтрокаПени.МесяцНалоговогоПериода, Настройки);
		
        Если СтрокаПени.СуммаЗадолженности <= 0 
            Или ПланируемаяДатаПеречисления = Неопределено 
            Или ДатаПеречисления = Неопределено
            Или ПланируемаяДатаПеречисления >= ДатаПеречисления Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПени.ПланируемаяДатаПеречисления = ПланируемаяДатаПеречисления;
		СтрокаПени.КоличествоДнейПросрочки = (НачалоДня(ДатаПеречисления) - НачалоДня(СтрокаПени.ПланируемаяДатаПеречисления)) / ДлинаСуток;
				
	КонецЦикла;
	
КонецПроцедуры

Функция СведенияОНастройкахПеречисленияВзносовИОтчислений(НалоговыеПериоды)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаАктуальности", НачалоДня(ДатаПеречисления) - 1);
	Запрос.УстановитьПараметр("ВидВзносаОтчисления", ВидНалогаВзносаОтчисления);
	Запрос.УстановитьПараметр("НалоговыеПериоды", НалоговыеПериоды);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НалоговыеПериоды.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТНалоговыеПериоды
		|ИЗ
		|	&НалоговыеПериоды КАК НалоговыеПериоды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиЗарплатаКадрыРасширенная.ВыплачиватьЗарплатуВПоследнийДеньМесяца
		|ПОМЕСТИТЬ ВТПорядокВыплатыЗарплаты
		|ИЗ
		|	РегистрСведений.НастройкиЗарплатаКадрыРасширенная КАК НастройкиЗарплатаКадрыРасширенная
		|ГДЕ
		|	НастройкиЗарплатаКадрыРасширенная.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Приоритет,
		|	СрокиПеречисленияВзносовИОтчислений.Период,
		|	СрокиПеречисленияВзносовИОтчислений.ДатаПеречисленияНеПозжеЧем,
		|	СрокиПеречисленияВзносовИОтчислений.ПорядокОпределенияСрокаПеречисления
		|ПОМЕСТИТЬ ВТСрокиПеречисленияВзносовИОтчисленийПоПриоритетам
		|ИЗ
		|	РегистрСведений.СрокиПеречисленияВзносовИОтчислений КАК СрокиПеречисленияВзносовИОтчислений
		|ГДЕ
		|	СрокиПеречисленияВзносовИОтчислений.Организация = &Организация
		|	И СрокиПеречисленияВзносовИОтчислений.ВидНалогаВзносаОтчисления = &ВидВзносаОтчисления
		|	И СрокиПеречисленияВзносовИОтчислений.Период <= &ДатаАктуальности
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	СрокиПеречисленияВзносовИОтчислений.Период,
		|	СрокиПеречисленияВзносовИОтчислений.ДатаПеречисленияНеПозжеЧем,
		|	СрокиПеречисленияВзносовИОтчислений.ПорядокОпределенияСрокаПеречисления
		|ИЗ
		|	РегистрСведений.СрокиПеречисленияВзносовИОтчислений КАК СрокиПеречисленияВзносовИОтчислений
		|ГДЕ
		|	СрокиПеречисленияВзносовИОтчислений.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	И СрокиПеречисленияВзносовИОтчислений.ВидНалогаВзносаОтчисления = &ВидВзносаОтчисления
		|	И СрокиПеречисленияВзносовИОтчислений.Период <= &ДатаАктуальности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриоритетыСроков.Период,
		|	ВТСрокиПеречисленияВзносовИОтчисленийПоПриоритетам.ДатаПеречисленияНеПозжеЧем,
		|	ВТСрокиПеречисленияВзносовИОтчисленийПоПриоритетам.ПорядокОпределенияСрокаПеречисления,
		|	ЕСТЬNULL(ВТПорядокВыплатыЗарплаты.ВыплачиватьЗарплатуВПоследнийДеньМесяца, ЛОЖЬ) КАК ВыплачиватьЗарплатуВПоследнийДеньМесяца
		|ПОМЕСТИТЬ ВТСрокиПеречисленияВзносовИОтчислений
		|ИЗ
		|	ВТСрокиПеречисленияВзносовИОтчисленийПоПриоритетам КАК ВТСрокиПеречисленияВзносовИОтчисленийПоПриоритетам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МИНИМУМ(ВТСрокиПеречисленияВзносовИОтчисленийПоПриоритетам.Приоритет) КАК Приоритет,
		|			ВТСрокиПеречисленияВзносовИОтчисленийПоПриоритетам.Период КАК Период
		|		ИЗ
		|			ВТСрокиПеречисленияВзносовИОтчисленийПоПриоритетам КАК ВТСрокиПеречисленияВзносовИОтчисленийПоПриоритетам
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТСрокиПеречисленияВзносовИОтчисленийПоПриоритетам.Период) КАК ПриоритетыСроков
		|		ПО ВТСрокиПеречисленияВзносовИОтчисленийПоПриоритетам.Приоритет = ПриоритетыСроков.Приоритет
		|			И ВТСрокиПеречисленияВзносовИОтчисленийПоПриоритетам.Период = ПриоритетыСроков.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПорядокВыплатыЗарплаты КАК ВТПорядокВыплатыЗарплаты
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыНастроек.МесяцНалоговогоПериода,
		|	ВТСрокиПеречисленияВзносовИОтчислений.ДатаПеречисленияНеПозжеЧем,
		|	ВТСрокиПеречисленияВзносовИОтчислений.ПорядокОпределенияСрокаПеречисления,
		|	ВТСрокиПеречисленияВзносовИОтчислений.ВыплачиватьЗарплатуВПоследнийДеньМесяца
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТНалоговыеПериоды.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		МАКСИМУМ(ВТСрокиПеречисленияВзносовИОтчислений.Период) КАК Период
		|	ИЗ
		|		ВТНалоговыеПериоды КАК ВТНалоговыеПериоды
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСрокиПеречисленияВзносовИОтчислений КАК ВТСрокиПеречисленияВзносовИОтчислений
		|			ПО ВТНалоговыеПериоды.МесяцНалоговогоПериода >= ВТСрокиПеречисленияВзносовИОтчислений.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТНалоговыеПериоды.МесяцНалоговогоПериода) КАК ПериодыНастроек
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСрокиПеречисленияВзносовИОтчислений КАК ВТСрокиПеречисленияВзносовИОтчислений
		|		ПО ПериодыНастроек.Период = ВТСрокиПеречисленияВзносовИОтчислений.Период";
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

Функция СтавкиИКоэффициентыПоПериоду(ПервыйДеньЗадержки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПервыйДеньЗадержки",	ПервыйДеньЗадержки);
	// включая день перечисления
	Запрос.УстановитьПараметр("ДатаПеречисления",	ДатаПеречисления);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ВидНалогаВзносаОтчисления", ВидНалогаВзносаОтчисления);
	Запрос.УстановитьПараметр("ПроизводсвенныйКалендарь", КалендарныеГрафики.ОсновнойПроизводственныйКалендарь());
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДанныеПроизводственногоКалендаря.Дата КАК Период
	               |ПОМЕСТИТЬ ВТ_ДатыПоДням
	               |ИЗ
	               |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	               |ГДЕ
	               |	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводсвенныйКалендарь
	               |	И ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ПервыйДеньЗадержки И &ДатаПеречисления
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДанныеСтавокРефинансирования.Период КАК Период,
	               |	ДанныеСтавокРефинансирования.Размер КАК Размер
	               |ПОМЕСТИТЬ ВТ_ДанныеСтавокРефинансирования
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СтавкаРефинансированияЦБСрезПоследних.Период КАК Период,
	               |		СтавкаРефинансированияЦБСрезПоследних.Размер КАК Размер
	               |	ИЗ
	               |		РегистрСведений.СтавкаРефинансированияЦБ.СрезПоследних(&ПервыйДеньЗадержки, ) КАК СтавкаРефинансированияЦБСрезПоследних
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		СтавкаРефинансированияЦБ.Период,
	               |		СтавкаРефинансированияЦБ.Размер
	               |	ИЗ
	               |		РегистрСведений.СтавкаРефинансированияЦБ КАК СтавкаРефинансированияЦБ
	               |	ГДЕ
	               |		СтавкаРефинансированияЦБ.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&ПервыйДеньЗадержки, ДЕНЬ, 1) И &ДатаПеречисления) КАК ДанныеСтавокРефинансирования
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ДанныеКоэффициентовСтавокРефинансирования.Период КАК Период,
	               |	КоэффициентыСтавкиРефинансированияНБ.Коэффициент КАК Коэффициент
	               |ПОМЕСТИТЬ ВТ_ДанныеКоэффициентовСтавокРефинансирования
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СтавкиПоПриоритетам.Период КАК Период,
	               |		МАКСИМУМ(СтавкиПоПриоритетам.Организация) КАК Организация
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			КоэффициентыСтавкиРефинансированияНБСрезПоследних.Период КАК Период,
	               |			КоэффициентыСтавкиРефинансированияНБСрезПоследних.Организация КАК Организация
	               |		ИЗ
	               |			РегистрСведений.КоэффициентыСтавкиРефинансированияНБ.СрезПоследних(
	               |					&ПервыйДеньЗадержки,
	               |					Организация = &Организация
	               |						И ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления) КАК КоэффициентыСтавкиРефинансированияНБСрезПоследних
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			КоэффициентыСтавкиРефинансированияНБСрезПоследних.Период,
	               |			КоэффициентыСтавкиРефинансированияНБСрезПоследних.Организация
	               |		ИЗ
	               |			РегистрСведений.КоэффициентыСтавкиРефинансированияНБ.СрезПоследних(
	               |					&ПервыйДеньЗадержки,
	               |					Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |						И ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления) КАК КоэффициентыСтавкиРефинансированияНБСрезПоследних
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			КоэффициентыСтавкиРефинансированияНБ.Период,
	               |			КоэффициентыСтавкиРефинансированияНБ.Организация
	               |		ИЗ
	               |			РегистрСведений.КоэффициентыСтавкиРефинансированияНБ КАК КоэффициентыСтавкиРефинансированияНБ
	               |		ГДЕ
	               |			КоэффициентыСтавкиРефинансированияНБ.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&ПервыйДеньЗадержки, ДЕНЬ, 1) И &ДатаПеречисления
	               |			И КоэффициентыСтавкиРефинансированияНБ.Организация = &Организация
	               |			И КоэффициентыСтавкиРефинансированияНБ.ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			КоэффициентыСтавкиРефинансированияНБ.Период,
	               |			КоэффициентыСтавкиРефинансированияНБ.Организация
	               |		ИЗ
	               |			РегистрСведений.КоэффициентыСтавкиРефинансированияНБ КАК КоэффициентыСтавкиРефинансированияНБ
	               |		ГДЕ
	               |			КоэффициентыСтавкиРефинансированияНБ.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&ПервыйДеньЗадержки, ДЕНЬ, 1) И &ДатаПеречисления
	               |			И КоэффициентыСтавкиРефинансированияНБ.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			И КоэффициентыСтавкиРефинансированияНБ.ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления) КАК СтавкиПоПриоритетам
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		СтавкиПоПриоритетам.Период) КАК ДанныеКоэффициентовСтавокРефинансирования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоэффициентыСтавкиРефинансированияНБ КАК КоэффициентыСтавкиРефинансированияНБ
	               |		ПО ДанныеКоэффициентовСтавокРефинансирования.Период = КоэффициентыСтавкиРефинансированияНБ.Период
	               |			И ДанныеКоэффициентовСтавокРефинансирования.Организация = КоэффициентыСтавкиРефинансированияНБ.Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДатыПоДням.Период КАК ДатаПериода,
	               |	МАКСИМУМ(ВТ_ДанныеКоэффициентовСтавокРефинансирования.Период) КАК ДатаКоэффициентаСтавкиРефинансирования,
	               |	МАКСИМУМ(ВТ_ДанныеСтавокРефинансирования.Период) КАК ДатаСтавкиРефинансирования
	               |ПОМЕСТИТЬ ВТ_МаксимумыДатРегистровПоПериодам
	               |ИЗ
	               |	ВТ_ДатыПоДням КАК ВТ_ДатыПоДням
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеКоэффициентовСтавокРефинансирования КАК ВТ_ДанныеКоэффициентовСтавокРефинансирования
	               |		ПО ВТ_ДатыПоДням.Период >= ВТ_ДанныеКоэффициентовСтавокРефинансирования.Период
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеСтавокРефинансирования КАК ВТ_ДанныеСтавокРефинансирования
	               |		ПО ВТ_ДатыПоДням.Период >= ВТ_ДанныеСтавокРефинансирования.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДатыПоДням.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_МаксимумыДатРегистровПоПериодам.ДатаПериода КАК ДатаПериода,
	               |	ВТ_ДанныеСтавокРефинансирования.Период КАК ПериодСтавки,
	               |	ЕСТЬNULL(ВТ_ДанныеСтавокРефинансирования.Размер, 0) / 100 КАК СтавкаРефинансирования,
	               |	ВТ_ДанныеКоэффициентовСтавокРефинансирования.Период КАК ПериодКоэффициентаСтавки,
	               |	ЕСТЬNULL(ВТ_ДанныеКоэффициентовСтавокРефинансирования.Коэффициент, 0) КАК КоэффициентСтавкиРефинансирования
	               |ИЗ
	               |	ВТ_МаксимумыДатРегистровПоПериодам КАК ВТ_МаксимумыДатРегистровПоПериодам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеСтавокРефинансирования КАК ВТ_ДанныеСтавокРефинансирования
	               |		ПО ВТ_МаксимумыДатРегистровПоПериодам.ДатаСтавкиРефинансирования = ВТ_ДанныеСтавокРефинансирования.Период
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеКоэффициентовСтавокРефинансирования КАК ВТ_ДанныеКоэффициентовСтавокРефинансирования
	               |		ПО ВТ_МаксимумыДатРегистровПоПериодам.ДатаКоэффициентаСтавкиРефинансирования = ВТ_ДанныеКоэффициентовСтавокРефинансирования.Период
	               |
				   |УПОРЯДОЧИТЬ ПО
				   |	ВТ_МаксимумыДатРегистровПоПериодам.ДатаПериода";

	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		СтавкиИКоэффициентыПоПериоду = РезультатЗапроса.Выгрузить();
	Иначе	
		СтавкиИКоэффициентыПоПериоду = Новый ТаблицаЗначений;
		СтавкиИКоэффициентыПоПериоду.Колонки.Добавить("ДатаПериода", Новый ОписаниеТипов("Дата"));
		СтавкиИКоэффициентыПоПериоду.Колонки.Добавить("КоэффициентСтавкиРефинансирования", Новый ОписаниеТипов("Число"));
		СтавкиИКоэффициентыПоПериоду.Колонки.Добавить("СтавкаРефинансирования", Новый ОписаниеТипов("Число"));
	КонецЕсли;
	
	СтавкиИКоэффициентыПоПериоду.Индексы.Добавить("ДатаПериода");
	
	Возврат СтавкиИКоэффициентыПоПериоду;
	
КонецФункции

Функция ПолучитьПланируемуюДатуПеречисления(МесяцНалоговогоПериода, Настройки)
	
	Отбор = Новый Структура("МесяцНалоговогоПериода", МесяцНалоговогоПериода);
	СтрокиНастройки = Настройки.НайтиСтроки(Отбор);
	Если СтрокиНастройки.Количество() = 0 Тогда
		ДеньМесяцаПеречисления = 25;
		ПорядокОпределенияСрокаПеречисления = Перечисления.ПорядокОпределенияСроковПеречисленияВзносовИОтчислений.ПоМесяцуНалоговогоПериода;
		ВыплачиватьЗарплатуВПоследнийДеньМесяца = Ложь;
	Иначе
		ДеньМесяцаПеречисления = СтрокиНастройки[0].ДатаПеречисленияНеПозжеЧем;
		ПорядокОпределенияСрокаПеречисления = СтрокиНастройки[0].ПорядокОпределенияСрокаПеречисления;
		ВыплачиватьЗарплатуВПоследнийДеньМесяца = СтрокиНастройки[0].ВыплачиватьЗарплатуВПоследнийДеньМесяца;
		
	КонецЕсли;
	
	Если ПорядокОпределенияСрокаПеречисления = Перечисления.ПорядокОпределенияСроковПеречисленияВзносовИОтчислений.ПоМесяцуНалоговогоПериода
		ИЛИ (ПорядокОпределенияСрокаПеречисления = Перечисления.ПорядокОпределенияСроковПеречисленияВзносовИОтчислений.ПоМесяцуВыплатыДоходов 
		И ВыплачиватьЗарплатуВПоследнийДеньМесяца) Тогда
		ПланируемаяДатаПеречисления =  Дата(Год(МесяцНалоговогоПериода) + ?(Месяц(МесяцНалоговогоПериода) = 12, 1, 0), 
											Месяц(МесяцНалоговогоПериода) + 1 - ?(Месяц(МесяцНалоговогоПериода) = 12, 12, 0), 
											ДеньМесяцаПеречисления); 
	Иначе 
		ПланируемаяДатаПеречисления =  Дата(Год(МесяцНалоговогоПериода) + ?(Месяц(МесяцНалоговогоПериода) >= 11, 1, 0), 
											Месяц(МесяцНалоговогоПериода) + 2 - ?(Месяц(МесяцНалоговогоПериода) >= 11, 12, 0), 
											ДеньМесяцаПеречисления); 
											
	КонецЕсли;
	
	ПланируемаяДатаПеречисления = ГрафикиРаботыСотрудниковЗУПК.ПолучитьСледующуюРабочуюДату(ПланируемаяДатаПеречисления);

	Возврат ПланируемаяДатаПеречисления;	
	
КонецФункции

Функция ЗаполнитьПодразделения(РасчетПени)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИсчислениеПени", РасчетПени);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидВзносаОтчисления", ВидНалогаВзносаОтчисления);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсчислениеПени.ФизическоеЛицо,
		|	ИсчислениеПени.МесяцНалоговогоПериода,
		|	ИсчислениеПени.РегистрацияВНалоговомОргане
		|ПОМЕСТИТЬ ВТИсчислениеПени
		|ИЗ
		|	&ИсчислениеПени КАК ИсчислениеПени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.Период КАК МесяцНалоговогоПериода,
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.Подразделение,
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.РегистрацияВНалоговомОргане,
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.ФизическоеЛицо,
		|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.НалогВзносОборот) КАК БазаРаспределения
		|ИЗ
		|	РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Месяц,
		|			Организация = &Организация
		|				И ВидНалогаВзносаОтчисления = &ВидВзносаОтчисления) КАК СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИсчислениеПени КАК ВТИсчислениеПени
		|		ПО СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.РегистрацияВНалоговомОргане = ВТИсчислениеПени.РегистрацияВНалоговомОргане
		|			И СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.ФизическоеЛицо = ВТИсчислениеПени.ФизическоеЛицо
		|			И СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.Период = ВТИсчислениеПени.МесяцНалоговогоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.Период,
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.Подразделение,
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.РегистрацияВНалоговомОргане,
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.ФизическоеЛицо";
		
	ТаблицаБазы = Запрос.Выполнить().Выгрузить();
	
	ПоляПоиска = "ФизическоеЛицо, РегистрацияВНалоговомОргане, МесяцНалоговогоПериода";
	Отбор = Новый Структура(ПоляПоиска);
	ТаблицаБазы.Индексы.Добавить(ПоляПоиска);
	
	РезультатыРасчетов = РасчетПени.СкопироватьКолонки();
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	
	
	Для Каждого СтрокаПени Из РасчетПени Цикл
		Отбор.ФизическоеЛицо = СтрокаПени.ФизическоеЛицо;
		Отбор.МесяцНалоговогоПериода = СтрокаПени.МесяцНалоговогоПериода;
		Отбор.РегистрацияВНалоговомОргане = СтрокаПени.РегистрацияВНалоговомОргане;
		СтрокиБазы = ТаблицаБазы.НайтиСтроки(Отбор);
		РаспределитьПоПодразделениям(РезультатыРасчетов, СтрокаПени, СтрокиБазы, "СуммаЗадолженности,Сумма");
	КонецЦикла;
	
	РезультатыРасчетов.Свернуть("ФизическоеЛицо, РегистрацияВНалоговомОргане, МесяцНалоговогоПериода, Подразделение, ПланируемаяДатаПеречисления, КоличествоДнейПросрочки", "СуммаЗадолженности,Сумма");
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Процедура РаспределитьПоПодразделениям(РезультатыРасчетов, СтрокаПени, СтрокиБазы, Ресурсы)
	
	МассивРесурсов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Ресурсы);
	КоэффициентыПодразделений = ОбщегоНазначения.ВыгрузитьКолонку(СтрокиБазы, "БазаРаспределения");    
	
	Для Каждого Ресурс Из МассивРесурсов Цикл 
		Если СтрокаПени[Ресурс] = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		РаспределениеРесурса = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СтрокаПени[Ресурс], КоэффициентыПодразделений, 2);
		Если РаспределениеРесурса = Неопределено Тогда
			НоваяСтрока = РезультатыРасчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПени,, Ресурсы);
			НоваяСтрока[Ресурс] = СтрокаПени[Ресурс];
		Иначе
			Индекс = 0;
			Для Каждого СтрокаБаза Из СтрокиБазы Цикл
				НоваяСтрока = РезультатыРасчетов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПени,, Ресурсы);
				НоваяСтрока.Подразделение = СтрокаБаза.Подразделение;
				НоваяСтрока[Ресурс] = РаспределениеРесурса[Индекс];
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеДляПроведения()
	
	ДанныеДляПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеняПоВзносамИОтчислениямИсчислениеПени.Ссылка,
		|	ПеняПоВзносамИОтчислениямИсчислениеПени.НомерСтроки,
		|	ПеняПоВзносамИОтчислениямИсчислениеПени.Подразделение,
		|	ПеняПоВзносамИОтчислениямИсчислениеПени.ФизическоеЛицо,
		|	ПеняПоВзносамИОтчислениямИсчислениеПени.МесяцНалоговогоПериода,
		|	ПеняПоВзносамИОтчислениямИсчислениеПени.РегистрацияВНалоговомОргане,
		|	ПеняПоВзносамИОтчислениямИсчислениеПени.ПланируемаяДатаПеречисления,
		|	ПеняПоВзносамИОтчислениямИсчислениеПени.КоличествоДнейПросрочки,
		|	ПеняПоВзносамИОтчислениямИсчислениеПени.СуммаЗадолженности,
		|	ПеняПоВзносамИОтчислениямИсчислениеПени.Сумма,
		|	ПеняПоВзносамИОтчислениямИсчислениеПени.Ссылка.ПериодРегистрации,
		|	ПеняПоВзносамИОтчислениямИсчислениеПени.Ссылка.ВидНалогаВзносаОтчисления,
		|	ПеняПоВзносамИОтчислениямИсчислениеПени.Ссылка.ВидПлатежа,
		|	ПеняПоВзносамИОтчислениямИсчислениеПени.Ссылка.СпособОтраженияЗарплатыВБухучете
		|ПОМЕСТИТЬ ВТПеняПоВзносамИОтчислениям
		|ИЗ
		|	Документ.ПеняПоВзносамИОтчислениям.ИсчислениеПени КАК ПеняПоВзносамИОтчислениямИсчислениеПени
		|ГДЕ
		|	ПеняПоВзносамИОтчислениямИсчислениеПени.Ссылка = &Ссылка
		|	И ПеняПоВзносамИОтчислениямИсчислениеПени.Сумма <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеняПоВзносамИОтчислениям.ФизическоеЛицо,
		|	ПеняПоВзносамИОтчислениям.ПериодРегистрации,
		|	ПеняПоВзносамИОтчислениям.МесяцНалоговогоПериода,
		|	ПеняПоВзносамИОтчислениям.ВидНалогаВзносаОтчисления,
		|	ПеняПоВзносамИОтчислениям.Сумма КАК НалогВзнос,
		|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПустаяСсылка) КАК ВидДохода,
		|	ПеняПоВзносамИОтчислениям.РегистрацияВНалоговомОргане
		|ПОМЕСТИТЬ ВТНалогиВзносыОтчисления
		|ИЗ
		|	ВТПеняПоВзносамИОтчислениям КАК ПеняПоВзносамИОтчислениям
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПеняПоВзносамИОтчислениям.ПериодРегистрации КАК Период,
		|	ВТПеняПоВзносамИОтчислениям.Подразделение,
		|	ВТПеняПоВзносамИОтчислениям.ФизическоеЛицо,
		|	ВТПеняПоВзносамИОтчислениям.ВидНалогаВзносаОтчисления,
		|	ВТПеняПоВзносамИОтчислениям.ВидПлатежа,
		|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПустаяСсылка) КАК ВидДохода,
		|	ВТПеняПоВзносамИОтчислениям.Сумма,
		|	ВТПеняПоВзносамИОтчислениям.СпособОтраженияЗарплатыВБухучете
		|ИЗ
		|	ВТПеняПоВзносамИОтчислениям КАК ВТПеняПоВзносамИОтчислениям";
		
		
	ТаблицаПени = Запрос.Выполнить().Выгрузить();

	ДанныеДляПроведения.Вставить("МенеджерВременныхТаблиц", Запрос.МенеджерВременныхТаблиц);
	ДанныеДляПроведения.Вставить("РезультатыРасчетаПени", ТаблицаПени);
	Возврат ДанныеДляПроведения;
	
КонецФункции


#КонецОбласти


#КонецЕсли
